app/controllers/purchases_controller.rb

  def index
    @purchases = Purchase.where("user_id = ?" ,  current_user.id)
---
SELECT `purchases`.* FROM `purchases` WHERE (user_id = 3)

  def create
    @purchase = Purchase.new(purchase_params)
    @purchase.user_id = current_user.id

    # stores current date only not
    time = Time.now.strftime("%Y-%m-%d")
    respond_to do |format|
     if @purchase.quantity<=0
        format.html { redirect_to @purchase, notice: 'Given quantity is not acceptable.' }

    elsif @purchase.expiry_date <= Date.parse(time)
        format.html { redirect_to @purchase, notice: 'Product is alreday expired, check the  expiry date' }

     else
        #find weather given item and uom matches to master table
    validate = Master.find_by(item_name: @purchase.item_name , uom: @purchase.unit_of_measure)

     if validate.present?
        # to find the unit_of_measure of least level
        factor = Master.find_by(item_name: @purchase.item_name , level: 1)
       # logic to find least count of quantity
        $i=1
        $total=1
        while $i <= validate.level
            factor = Master.find_by(item_name: @purchase.item_name , level: $i)
            $total *= factor.units*factor.conversion
            $i += 1
        end
        factor = Master.find_by(item_name: @purchase.item_name , level: 1)

       if @purchase.save
---
INSERT INTO `purchases` (`wholesaler`, `item_name`, `quantity`, `unit_of_measure`, `batch_number`, `total_price`, `expiry_date`, `date_of_purchase`, `user_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_purchase
      @purchase = Purchase.where("user_id = ?" , current_user.id).find(params[:id])
---
SELECT  `purchases`.* FROM `purchases` WHERE `purchases`.`user_id` = ? AND `purchases`.`id` = ? LIMIT 1  [["user_id", 3], ["id", 1]]