app/controllers/sales_controller.rb

SELECT `sales`.* FROM `sales` WHERE (user_id = 3)
---
  def index
    @sales = Sale.where("user_id = ?" ,  current_user.id)

SELECT  `items`.* FROM `items` WHERE (user_id = 1 and item_name = 'jsdcbnk')  ORDER BY `items`.`id` ASC LIMIT 1
---
  def create
    @sale = Sale.new(sale_params)
    @sale.user_id = current_user.id

    #Now various validations
    respond_to do |format|
     if @sale.quantity<=0
        format.html { redirect_to @sale, notice: 'Given quantity is not acceptable.' }

      # as specified retailer can sale product even if item's quantity is less than required
 #    elsif stock.quantity < @sale.quantity*$total
  #      format.html { redirect_to @sale, notice: 'Required quantity is not available in stock' }

     elsif @sale.total_price<=0
      format.html { redirect_to @sale, notice: 'Total price less than zero is not exceptable.' }

     else
        #find weather given item and uom matches to master table
        validate = Master.find_by(item_name: @sale.item_name , uom: @sale.unit_of_measure)

INSERT INTO `sales` (`customer`, `item_name`, `quantity`, `unit_of_measure`, `batch_number`, `total_price`, `expiry_date`, `date_of_purchase`, `user_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
             if @sale.total_price > mrp
                 format.html { redirect_to @sale , notice: 'Total price cannot be greater than maximium selling price.' }

             elsif @sale.save

SELECT  `sales`.* FROM `sales` WHERE `sales`.`id` = ? LIMIT 1  [["id", 2]]
---
    def set_sale
      @sale = Sale.where("user_id = ?" ,  current_user.id).find(params[:id])